app/controllers/books_controller.rb

INSERT INTO "books" ("title", "body", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "てすと２"], ["body", "てすと"], ["user_id", 1], ["created_at", "2019-05-28 02:03:46.115840"], ["updated_at", "2019-05-28 02:03:46.115840"]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def create
    @books = Book.all
    @book = Book.new(book_params)
    @book.user_id = current_user.id
    if @book.save
      flash[:notice] = "successfully"
      redirect_to book_path(@book)
    else
      @user = User.find(current_user.id)

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "books".* FROM "books"
---
  def index
    @user = User.find(current_user.id)
    @book = Book.new
    @books = Book.all

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @book = Book.new
    @detail_book = Book.find(params[:id])