app/controllers/users_controller.rb

  def update
    @user = User.find(params[:id])
    if @user.update(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "profile_image_id" = ?, "introduction" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["profile_image_id", "fc66508d4ab8d0afc3d2bb639e967f39d263070a49e3f463f71f7bae4c3c"], ["introduction", ""], ["updated_at", "2019-05-23 05:53:11.883674"], ["id", 1]]

  def index
    @user = User.find(current_user.id)
    @users = User.all
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "users".* FROM "users"